---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ScheduleFormatParam
source: html/8c7630ad-2d03-5a45-1fe4-25aec1747943.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ScheduleFormatParam Property

"Formatting"

## Syntax (C#)
```csharp
public static ForgeTypeId ScheduleFormatParam { get; }
```